package story;

public class StoryText {

    String background = """
            ------------------------------------------------------------------------
            | 추운 겨울날, 나는 자랑스러운 한화 21기 백엔드 SW camp 수업을 듣기 위한 대장정을 떠난다 | 
            ------------------------------------------------------------------------
            """;
    String beforeFirstFloor = """
            ------------------------------------------------------------------------
            |             우선 집에서 나가자. 지하철이든 버스든 좋다. 얼른 타자.               |
            ------------------------------------------------------------------------
            """;
    String nowFirstFloor = """
            ------------------------------------------------------------------------
            |           지하철에 사람이 너무 많다. 한 승객이 서 있는 나를 덮쳐온다!             |
            ------------------------------------------------------------------------
            """;
    String beforeSecondFloor = """
            ------------------------------------------------------------------------
            |                 휴, 겨우 물리치고 드디어 건물 앞에 도착했다.                   | 
            |                저건...? 건물 바로 앞에서 담배를 피는 흡연자다!                 |
            ------------------------------------------------------------------------
            """;
    String nowSecondFloor = """
            ------------------------------------------------------------------------
            |                     흡연자가 담배 연기를 내뿜어온다!                         |
            ------------------------------------------------------------------------
            """;
    String afterSecondFloor = """
            ------------------------------------------------------------------------
            |                   흡연자를 물리치고 입장 카드키를 얻었다.                      |
            |                          너무 독한 냄새였어...                            | 
            ------------------------------------------------------------------------
            """;
    String beforeThirdFloor = """
            ------------------------------------------------------------------------
            |                건물에는 카드키로 들어왔지만 아직 방심할 수 없다.                 |
            ------------------------------------------------------------------------
            """;
    String nowThirdFloor = """
            ------------------------------------------------------------------------
            |                  헉, 입실 체크를 재촉하는 아름 매니저님이다!                   |
            ------------------------------------------------------------------------
            """;
    String afterThirdFloor = """
            ------------------------------------------------------------------------
            |          재빨리 입실 체크를 하고 들어올 수 있었다. 다행히 늦지 않았어.             |
            ------------------------------------------------------------------------
            """;
    String beforeFourthFloor = """
            ------------------------------------------------------------------------
            |                    드디어 문 앞이다. 뭐야 이 공기는...?                     |
            ------------------------------------------------------------------------
            """;
    String nowFourthFloor = """
            ------------------------------------------------------------------------
            |                 학생들로 가득찬 창문 없는 공간의 무거운 공기다!                 |
            ------------------------------------------------------------------------
            """;
    String afterFourthFloor = """
            ------------------------------------------------------------------------
            |                선풍기와 공기청정기 덕분에 겨우 해치울 수 있었다.                 |
            ------------------------------------------------------------------------ 
            """;
    String nowFifthFloor = """
            ------------------------------------------------------------------------
            |                   오늘의 교육을 마치기 위한 마지막 관문이다.                   |
            ------------------------------------------------------------------------ 
            """;
    String afterFifthFloor = """
            ------------------------------------------------------------------------
            |      8시간 알고리즘 풀강의는 정말 쉽지 않았어... 그래도 열심히 들은 나 정말 대단해!    |
            ------------------------------------------------------------------------
            """;
    String finalText = """
            ------------------------------------------------------------------------
            |    힘들었지만 알찬 하루였다. 내일도 오늘처럼만 하자. 이 교육이 끝날때까지 모두 화이팅!   |
            ------------------------------------------------------------------------
            """;

    public String getBackground() {
        return background;
    }

    public String getBeforeFirstFloor() {
        return beforeFirstFloor;
    }

    public String getNowFirstFloor() {
        return nowFirstFloor;
    }

    public String getBeforeSecondFloor() {
        return beforeSecondFloor;
    }

    public String getNowSecondFloor() {
        return nowSecondFloor;
    }

    public String getAfterSecondFloor() {
        return afterSecondFloor;
    }

    public String getBeforeThirdFloor() {
        return beforeThirdFloor;
    }

    public String getNowThirdFloor() {
        return nowThirdFloor;
    }

    public String getAfterThirdFloor() {
        return afterThirdFloor;
    }

    public String getBeforeFourthFloor() {
        return beforeFourthFloor;
    }

    public String getNowFourthFloor() {
        return nowFourthFloor;
    }

    public String getAfterFourthFloor() {
        return afterFourthFloor;
    }

    public String getNowFifthFloor() {
        return nowFifthFloor;
    }

    public String getAfterFifthFloor() {
        return afterFifthFloor;
    }

    public String getFinalText() {
        return finalText;
    }
}
